app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" IS NULL LIMIT 1
---
  def show
    @article = Article.find_by_id(params[:id])